<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/3_inplace%3DTrue.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- https://www.aboutdatablog.com/post/learn-how-to-use-pandas-inplace-parameter-once-and-for-all

#### **Functions that use inplace paarmeter**

- Let’s have a look at some examples of **functions that use inplace**:

 - fillna()

 - dropna()

 - sort_values()

 - reset_index()

 - sort_index()

 - rename()

In [1]:
import pandas as pd
import numpy as np

In [2]:
client_dictionary = {'name': ['Michael', 'Ana', 'Sean', 'Carl', 'Bob'], 
                     'second name': [None, 'Angel', 'Ben', 'Frank', 'Daniel'],
                     'birth place': ['New York', 'New York', 'Los Angeles', 'New York', 'New York'],
                     'age': [10, 35, 56, None, 28],
                     'number of children': [0, None, 2, 1, 1]}

df = pd.DataFrame(client_dictionary)
df.head()

      name second name  birth place   age  number of children
0  Michael        None     New York  10.0                 0.0
1      Ana       Angel     New York  35.0                 NaN
2     Sean         Ben  Los Angeles  56.0                 2.0
3     Carl       Frank     New York   NaN                 1.0
4      Bob      Daniel     New York  28.0                 1.0

- We have created a data frame with five rows with the following columns: name, second name, birthplace, and number of children. Note that there are some missing values in age, second name, and children column (NaNs).

- We will now demonstrate how dropna() function works with inplace parameter. Because we would like to examine two different variants we are going to create two copies of our original data frame.

In [3]:
df_1 = df.copy()
df_2 = df.copy()

#### **dropna() with inplace = True**

- Let’s start with the variation where **inplace=True**. The code below **drops all missing rows with missing values.**

In [4]:
df_1.dropna(inplace=True)

- If you run this in Jupyter notebook you will see that the **cell has no output**. This is because function with **inplace=True** does **not return anything.** It modifies an existing data frame with the desired operation and does it ‘in place’, that is on the original data frame.

- If you run head() function on the data frame you should see that two rows are dropped.

In [5]:
df_1.head()

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

#### **dropna() with inplace = False (default)**

- Now let’s run the same code with **inplace = False.** Note that we are now going to use df_2 version of data frame this time.

In [6]:
df_2.dropna(inplace=False)

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

- If you run this code in Jupyter notebook you will see that **there is an output** (the screenshot above). The function with **inplace = False** returns a **data frame with dropped rows.**

- Remember that when **inplace was set to True nothing was returned** but the **original data frame was modified.**

- So what happens with the original data frame this time? Let’s call head() function to check.

In [7]:
df_2.head()

      name second name  birth place   age  number of children
0  Michael        None     New York  10.0                 0.0
1      Ana       Angel     New York  35.0                 NaN
2     Sean         Ben  Los Angeles  56.0                 2.0
3     Carl       Frank     New York   NaN                 1.0
4      Bob      Daniel     New York  28.0                 1.0

- The original data frame is unchanged! So what happened?

- When you use **inplace=True** the new object is created and changed instead of the original data frame. If you wanted to update the original data frame to reflect the dropped rows you would have to reassign the result to the original data frame as shown in the code below.

In [8]:
df_2 = df_2.dropna(inplace=False)

In [12]:
df_2

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

- But wait! This is exactly what we were doing when using inplace=True. Yes, this last line of code is equivalent to the following line:

In [ ]:
df_2.dropna(inplace=True)

### **Common mistakes**

 - **using inplace = True with a slice of the dataframe**

- I have noticed that several times. Let’s go back to our data frame example from the beginning of this article. There are free columns that have None values: second name, age, and number of children.

- What do we do if we just want to drop None’s from the **second name and age column** and **leave the number of children column unchanged?**

- I have seen people try to do the following:

### **This is probably something you do not want to do!**

#### **In fact, this should throw the following warning.**

In [9]:
df[['second name', 'age']].dropna(inplace=True)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

- This warning is shown because **pandas designers are nice** and they actually try to warn you from doing something that you probably do not want to do. The code is changing the slice of the data frame that has only two columns not the original data frame. The reason for this is that you have chosen a slice of the data frame and you apply dropna() to this slice and not the original data frame.

- In order to correct it use **dropna() on the whole data frame with subset parameter.**

In [10]:
df.dropna(inplace=True, subset=['second name', 'age'])
df.head()

   name second name  birth place   age  number of children
1   Ana       Angel     New York  35.0                 NaN
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

- This should result in **rows with null values** in **second name and age column** being dropped from the data frame.

#### **assigning variable value to the result of inplace = True**

In [11]:
df = df.dropna(inplace=True)

- This is again something you never should do! You just reassigning None to value of df. Remember when you use inplace=True then nothing is returned. Therefore the result on this code will assign None to df.